; domain
(define (domain freecell_2_1-domain)
 (:requirements :strips :typing)
 (:predicates (on ?c1 - object ?c2 - object) (incell ?c - object) (clear ?c - object) (cellspace ?n - object) (colspace ?n - object) (home ?c - object) (bottomcol ?c - object) (canstack ?c1 - object ?c2 - object) (suit ?c - object ?s - object) (value ?c - object ?v - object) (successor ?n1 - object ?n0 - object))
 (:action move
  :parameters ( ?card - object ?oldcard - object ?newcard - object)
  :precondition (and (clear ?card) (clear ?newcard) (canstack ?card ?newcard) (on ?card ?oldcard))
  :effect (and (on ?card ?newcard) (clear ?oldcard) (not (on ?card ?oldcard)) (not (clear ?newcard))))
 (:action move_b
  :parameters ( ?card - object ?newcard - object ?cols - object ?ncols - object)
  :precondition (and (clear ?card) (bottomcol ?card) (clear ?newcard) (canstack ?card ?newcard) (colspace ?cols) (successor ?ncols ?cols))
  :effect (and (on ?card ?newcard) (colspace ?ncols) (not (bottomcol ?card)) (not (clear ?newcard)) (not (colspace ?cols))))
 (:action sendtofree
  :parameters ( ?card - object ?oldcard - object ?cells - object ?ncells - object)
  :precondition (and (clear ?card) (on ?card ?oldcard) (cellspace ?cells) (successor ?cells ?ncells))
  :effect (and (incell ?card) (clear ?oldcard) (cellspace ?ncells) (not (on ?card ?oldcard)) (not (clear ?card)) (not (cellspace ?cells))))
 (:action sendtofree_b
  :parameters ( ?card - object ?cells - object ?ncells - object ?cols - object ?ncols - object)
  :precondition (and (clear ?card) (bottomcol ?card) (cellspace ?cells) (successor ?cells ?ncells) (colspace ?cols) (successor ?ncols ?cols))
  :effect (and (incell ?card) (colspace ?ncols) (cellspace ?ncells) (not (bottomcol ?card)) (not (clear ?card)) (not (colspace ?cols)) (not (cellspace ?cells))))
 (:action sendtonewcol
  :parameters ( ?card - object ?oldcard - object ?cols - object ?ncols - object)
  :precondition (and (clear ?card) (colspace ?cols) (successor ?cols ?ncols) (on ?card ?oldcard))
  :effect (and (bottomcol ?card) (clear ?oldcard) (colspace ?ncols) (not (on ?card ?oldcard)) (not (colspace ?cols))))
 (:action sendtohome
  :parameters ( ?card - object ?oldcard - object ?suit - object ?vcard - object ?homecard - object ?vhomecard - object)
  :precondition (and (clear ?card) (on ?card ?oldcard) (home ?homecard) (suit ?card ?suit) (suit ?homecard ?suit) (value ?card ?vcard) (value ?homecard ?vhomecard) (successor ?vcard ?vhomecard))
  :effect (and (home ?card) (clear ?oldcard) (not (on ?card ?oldcard)) (not (home ?homecard)) (not (clear ?card))))
 (:action sendtohome_b
  :parameters ( ?card - object ?suit - object ?vcard - object ?homecard - object ?vhomecard - object ?cols - object ?ncols - object)
  :precondition (and (clear ?card) (bottomcol ?card) (home ?homecard) (suit ?card ?suit) (suit ?homecard ?suit) (value ?card ?vcard) (value ?homecard ?vhomecard) (successor ?vcard ?vhomecard) (colspace ?cols) (successor ?ncols ?cols))
  :effect (and (home ?card) (colspace ?ncols) (not (home ?homecard)) (not (clear ?card)) (not (bottomcol ?card)) (not (colspace ?cols))))
 (:action homefromfreecell
  :parameters ( ?card - object ?suit - object ?vcard - object ?homecard - object ?vhomecard - object ?cells - object ?ncells - object)
  :precondition (and (incell ?card) (home ?homecard) (suit ?card ?suit) (suit ?homecard ?suit) (value ?card ?vcard) (value ?homecard ?vhomecard) (successor ?vcard ?vhomecard) (cellspace ?cells) (successor ?ncells ?cells))
  :effect (and (home ?card) (cellspace ?ncells) (not (incell ?card)) (not (cellspace ?cells)) (not (home ?homecard))))
 (:action colfromfreecell
  :parameters ( ?card - object ?newcard - object ?cells - object ?ncells - object)
  :precondition (and (incell ?card) (clear ?newcard) (canstack ?card ?newcard) (cellspace ?cells) (successor ?ncells ?cells))
  :effect (and (cellspace ?ncells) (clear ?card) (on ?card ?newcard) (not (incell ?card)) (not (cellspace ?cells)) (not (clear ?newcard))))
 (:action newcolfromfreecell
  :parameters ( ?card - object ?cols - object ?ncols - object ?cells - object ?ncells - object)
  :precondition (and (incell ?card) (colspace ?cols) (cellspace ?cells) (successor ?cols ?ncols) (successor ?ncells ?cells))
  :effect (and (bottomcol ?card) (clear ?card) (colspace ?ncols) (cellspace ?ncells) (not (incell ?card)) (not (colspace ?cols)) (not (cellspace ?cells))))
)

; problem
(define (problem freecell_2_1-problem)
 (:domain freecell_2_1-domain)
 (:objects
   s h d c n8 n7 n6 n5 n4 n3 n13 n12 n11 n9 n10 sa s2 s0 ha h2 h0 da d2 d0 n1 ca n2 c2 n0 c0 - object
 )
 (:init (value c0 n0) (value c2 n2) (value ca n1) (value d0 n0) (value d2 n2) (value da n1) (value h0 n0) (value h2 n2) (value ha n1) (value s0 n0) (value s2 n2) (value sa n1) (successor n1 n0) (successor n10 n9) (successor n11 n10) (successor n12 n11) (successor n13 n12) (successor n2 n1) (successor n3 n2) (successor n4 n3) (successor n5 n4) (successor n6 n5) (successor n7 n6) (successor n8 n7) (successor n9 n8) (suit c0 c) (suit c2 c) (suit ca c) (suit d0 d) (suit d2 d) (suit da d) (suit h0 h) (suit h2 h) (suit ha h) (suit s0 s) (suit s2 s) (suit sa s) (canstack ca d2) (canstack ca h2) (canstack da c2) (canstack da s2) (canstack ha c2) (canstack ha s2) (canstack sa d2) (canstack sa h2) (home c0) (home d0) (home h0) (home s0) (cellspace n4) (colspace n2) (on c2 ca) (on ca sa) (clear c2) (clear d2) (clear da) (clear h2) (clear ha) (clear s2) (bottomcol d2) (bottomcol da) (bottomcol h2) (bottomcol ha) (bottomcol s2) (bottomcol sa))
 (:goal (and (home c2) (home d2) (home h2) (home s2)))
)

; plan
1. (sendtohome_b ha h n1 h0 n0 n2 n3)
   deleted: (home h0) (clear ha) (bottomcol ha) (colspace n2)
   added: (home ha) (colspace n3)
   goals met: 0 of 4
2. (sendtohome_b da d n1 d0 n0 n3 n4)
   deleted: (home d0) (clear da) (bottomcol da) (colspace n3)
   added: (home da) (colspace n4)
   goals met: 0 of 4
3. (sendtohome_b d2 d n2 da n1 n4 n5)
   deleted: (home da) (clear d2) (bottomcol d2) (colspace n4)
   added: (home d2) (colspace n5)
   goals met: 1 of 4
4. (sendtohome_b h2 h n2 ha n1 n5 n6)
   deleted: (home ha) (clear h2) (bottomcol h2) (colspace n5)
   added: (home h2) (colspace n6)
   goals met: 2 of 4
5. (sendtofree c2 ca n4 n3)
   deleted: (on c2 ca) (clear c2) (cellspace n4)
   added: (incell c2) (clear ca) (cellspace n3)
   goals met: 2 of 4
6. (sendtohome ca sa c n1 c0 n0)
   deleted: (on ca sa) (home c0) (clear ca)
   added: (home ca) (clear sa)
   goals met: 2 of 4
7. (sendtohome_b sa s n1 s0 n0 n6 n7)
   deleted: (home s0) (clear sa) (bottomcol sa) (colspace n6)
   added: (home sa) (colspace n7)
   goals met: 2 of 4
8. (sendtohome_b s2 s n2 sa n1 n7 n8)
   deleted: (home sa) (clear s2) (bottomcol s2) (colspace n7)
   added: (home s2) (colspace n8)
   goals met: 3 of 4
9. (homefromfreecell c2 c n2 ca n1 n3 n4)
   deleted: (incell c2) (cellspace n3) (home ca)
   added: (home c2) (cellspace n4)
   goals met: 4 of 4
